Австралия/src/InformationRegisters/ReorderPointSettings/ReorderPointSettings.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ReorderPointSettings</name>
  <resources>
    <name>InventoryMinimumLevel</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>InventoryMaximumLevel</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Products</name>
    <type>
      <types>CatalogRef.Products</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Characteristic</name>
    <type>
      <types>CatalogRef.ProductsCharacteristics</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Австралия/src/Enums/ProductsTypes/ProductsTypes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ProductsTypes</name>
  <enumValues>
    <name>InventoryItem</name>
  </enumValues>
  <enumValues>
    <name>Service</name>
  </enumValues>
  <enumValues>
    <name>Work</name>
  </enumValues>
</mdclass:Enum>

Австралия/src/InformationRegisters/ReorderPointSettings/Forms/ListForm/Module.bsl
#Region ProcedureFormEventHandlers

&AtServer
// Procedure-handler of the OnCreateAtServer event.
// Performs initial attributes forms filling.
//
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	
	If Parameters.Property("Filter") AND Parameters.Filter.Property("Products") Then
		
		Products = Parameters.Filter.Products;
		
		If Not Products.ProductsType = Enums.ProductsTypes.InventoryItem Then
			
			AutoTitle = False;
			Title = NStr("en = 'Reorder point settings is used only for inventories'; ru = 'Управление запасами используется только для запасов';pl = 'Stany mini/maks są używane tylko w przypadku zapasów';es_ES = 'Configuraciones del punto de reordenación se utilizan solo para inventarios';es_CO = 'Configuraciones del punto de reordenación se utilizan solo para inventarios';tr = 'Yeni sipariş noktası ayarları sadece stoklar için kullanılır';it = 'Le impostazioni dei punti di riordino sono utilizzate solo per le scorte';de = 'Einstellungen Nachbestellpunkt werden nur für Bestände verwendet'");
			
			Items.List.ReadOnly = True;
			
		EndIf;
		
	EndIf;
	
EndProcedure

#EndRegion
